In [4]:
import pandas as pd


student_dict =  {"name":["Joe","Nat"],"age":[20,33],"marks":[90,45]}


print(student_dict)

df = pd.DataFrame(student_dict)

df

{'name': ['Joe', 'Nat'], 'age': [20, 33], 'marks': [90, 45]}

  name  age  marks
0  Joe   20     90
1  Nat   33     45

In [5]:
# read the csv 

df = pd.read_csv("Automobile_data.csv")

df

          company   body-style  length engine-type  avg-mileage
0     alfa-romero  convertible   168.8        dohc           21
1     alfa-romero    hatchback   171.2        ohcv           19
2            audi        sedan   176.6         ohc           24
3            audi        sedan   176.6         ohc           18
4            audi        sedan   177.3         ohc           19
5            audi        wagon   192.7         ohc           19
6             bmw        sedan   176.8         ohc           23
7             bmw        sedan   176.8         ohc           23
8             bmw        sedan   176.8         ohc           21
9             bmw        sedan   189.0         ohc           16
10            bmw        sedan   193.8         ohc           16
11            bmw        sedan   197.0         ohc           15
12      chevrolet    hatchback   141.1         ohc           47
13      chevrolet    hatchback   155.9         ohc           38
14      chevrolet        sedan   158.8         ohc           38
15          dodge    hatchback   157.3         ohc           31
16          dodge    hatchback   157.3         ohc           31
17          honda        wagon   157.1         ohc           30
18          honda        sedan   175.4         ohc           24
19          honda        sedan   169.1         ohc           25
20          isuzu        sedan   170.7         ohc           24
21          isuzu        sedan   155.9         ohc           38
22          isuzu        sedan   155.9         ohc           38
23         jaguar        sedan   199.6        dohc           15
24         jaguar        sedan   199.6        dohc           15
25         jaguar        sedan   191.7        ohcv           13
26          mazda    hatchback   159.1         ohc           30
27          mazda    hatchback   159.1         ohc           31
28          mazda    hatchback   159.1         ohc           31
29          mazda    hatchback   169.0       rotor           17
30          mazda        sedan   175.0         ohc           31
31  mercedes-benz        sedan   190.9         ohc           22
32  mercedes-benz        wagon   190.9         ohc           22
33  mercedes-benz        sedan   208.1        ohcv           14
34  mercedes-benz      hardtop   199.2        ohcv           14
35     mitsubishi    hatchback   157.3         ohc           37
36     mitsubishi    hatchback   157.3         ohc           31
37     mitsubishi        sedan   172.4         ohc           25
38     mitsubishi        sedan   172.4         ohc           25
39         nissan        sedan   165.3         ohc           45
40         nissan        sedan   165.3         ohc           31
41         nissan        sedan   165.3         ohc           31
42         nissan        wagon   170.2         ohc           31
43         nissan        sedan   184.6        ohcv           19
44        porsche      hardtop   168.9        ohcf           17
45        porsche  convertible   168.9        ohcf           17
46        porsche    hatchback   175.7       dohcv           17
47         toyota    hatchback   158.7         ohc           35
48         toyota    hatchback   158.7         ohc           31
49         toyota    hatchback   158.7         ohc           31
50         toyota        wagon   169.7         ohc           31
51         toyota        wagon   169.7         ohc           27
52         toyota        wagon   169.7         ohc           27
53         toyota        wagon   187.8        dohc           19
54     volkswagen        sedan   171.7         ohc           37
55     volkswagen        sedan   171.7         ohc           27
56     volkswagen        sedan   171.7         ohc           37
57     volkswagen        sedan   171.7         ohc           26
58          volvo        sedan   188.8         ohc           23
59          volvo        wagon   188.8         ohc           23

In [6]:
df.head()

       company   body-style  length engine-type  avg-mileage
0  alfa-romero  convertible   168.8        dohc           21
1  alfa-romero    hatchback   171.2        ohcv           19
2         audi        sedan   176.6         ohc           24
3         audi        sedan   176.6         ohc           18
4         audi        sedan   177.3         ohc           19

In [7]:
df.tail()

       company body-style  length engine-type  avg-mileage
55  volkswagen      sedan   171.7         ohc           27
56  volkswagen      sedan   171.7         ohc           37
57  volkswagen      sedan   171.7         ohc           26
58       volvo      sedan   188.8         ohc           23
59       volvo      wagon   188.8         ohc           23

In [8]:
# customise the display of dataframes 

pd.options.display.max_rows = 20  # setting the maximum rows 

pd.set_option("display.min_rows",5) # setting the minimum rows 

df

        company   body-style  length engine-type  avg-mileage
0   alfa-romero  convertible   168.8        dohc           21
1   alfa-romero    hatchback   171.2        ohcv           19
..          ...          ...     ...         ...          ...
58        volvo        sedan   188.8         ohc           23
59        volvo        wagon   188.8         ohc           23

[60 rows x 5 columns]

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60 entries, 0 to 59
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   company      60 non-null     object
 1   body-style   60 non-null     object
 2   length       60 non-null     float64
 3   engine-type  60 non-null     object
 4   avg-mileage  60 non-null     int64
dtypes: float64(1), int64(1), object(3)
memory usage: 2.5+ KB

In [10]:
df.describe()

           length  avg-mileage
count   60.000000    60.000000
mean   173.170000    25.883333
std     14.128914     8.174146
min    141.100000    13.000000
25%    159.100000    19.000000
50%    171.450000    25.000000
75%    179.125000    31.000000
max    208.100000    47.000000

In [11]:
student_dict =  {"name":["Joe","Nat"],"age":[20,33],"marks":[90,45]}


# print(student_dict)

df = pd.DataFrame(student_dict)

df

{'name': ['Joe', 'Nat'], 'age': [20, 33], 'marks': [90, 45]}

  name  age  marks
0  Joe   20     90
1  Nat   33     45

In [12]:
df.describe()

             age      marks
count   2.000000   2.000000
mean   26.500000  67.500000
std     9.192388  31.819805
min    20.000000  45.000000
25%    23.250000  56.250000
50%    26.500000  67.500000
75%    29.750000  78.750000
max    33.000000  90.000000

In [13]:
# dataframe attributes

df.index

RangeIndex(start=0, stop=2, step=1)

In [14]:
df.columns

Index(['name', 'age', 'marks'], dtype='object')

In [16]:
df.dtypes

name     object
age       int64
marks     int64
dtype: object

In [17]:
df.values

array([['Joe', 20, 90],
       ['Nat', 33, 45]], dtype=object)

In [19]:
df.empty # to check the dataframe is empty or not

False

In [20]:
df.size # to get total number of values

6

In [22]:
df.shape  # to get no. of rows and columns

(2, 3)

In [23]:
df.head(2)

  name  age  marks
0  Joe   20     90
1  Nat   33     45

In [24]:
df.tail(1)

  name  age  marks
1  Nat   33     45

In [28]:
df.iat[0,0]

'Joe'

In [29]:
df.at[0,'name']

'Joe'

In [31]:
df.at[1,'name']

'Nat'

In [32]:
df.get('name')

0    Joe
1    Nat
Name: name, dtype: object

In [34]:
df.loc[0:2,'age']

0    20
1    33
Name: age, dtype: int64

In [35]:
df.loc[0:2,'marks']

0    90
1    45
Name: marks, dtype: int64

In [37]:
df.iloc[0:2,0:2]

  name  age
0  Joe   20
1  Nat   33

In [43]:
df.drop(columns='Class')

  name  age class  marks
0  Joe   20     A     90
1  Nat   33     A     45

In [49]:
df.insert(loc=2,column='Grade',value='A')

df

ValueError: cannot insert Grade, already exists

In [50]:
df.drop(columns='Class')

  name  age Grade class  marks
0  Joe   20     A     A      0
1  Nat   33     A     A     45

In [51]:
# filter the dataframe 

filter = df['marks']<50 

df['marks'].where(filter,other=0,inplace=True)

df

  name  age Grade class Class  marks
0  Joe   20     A     A     A      0
1  Nat   33     A     A     A     45

In [52]:
student_dict =  {"name":["Joe","Nat"],"age":[20,33],"marks":[90,45]}


# print(student_dict)

df = pd.DataFrame(student_dict)

df

  name  age  marks
0  Joe   20     90
1  Nat   33     45

In [57]:
filter = df['marks']>50

df.where(filter,other=50,inplace=False)

df

  name  age  marks
0  Joe   20     90
1  Nat   33     45

In [59]:
std_df = df.filter(like='n',axis='columns')
std_df

  name
0  Joe
1  Nat

In [60]:
student_df = df.rename(columns={'name':"Name"})

student_df

  Name  age  marks
0  Joe   20     90
1  Nat   33     45

In [61]:
student_df = df.rename(columns={"name":"Name","age":"Age","marks":"Marks"}) # rename the columns

student_df

  Name  Age  Marks
0  Joe   20     90
1  Nat   33     45

In [63]:
student_dict = {"Name":["John","Nick"],"Age":[12,33]}

df1 = pd.DataFrame(student_dict)

df1

   Name  Age
0  John   12
1  Nick   33

In [64]:
marks_dict = {'Marks':[45.7,67.8]}

df2 =pd.DataFrame(marks_dict)

df2

   Marks
0   45.7
1   67.8

In [66]:
# join the dataframes 

df1.join(df2)

   Name  Age  Marks
0  John   12   45.7
1  Nick   33   67.8

In [67]:
student_dict = {"Name":["Joe","Nat","Harry"],"Class":["A","B","A"],"Marks":[85.10,56.67,44.7]}


student_df = pd.DataFrame(student_dict)

student_df

    Name Class  Marks
0    Joe     A  85.10
1    Nat     B  56.67
2  Harry     A  44.70

In [68]:
student_df= student_df.groupby('Class').mean()

student_df

<ipython-input-68-d97d09871048>:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  student_df= student_df.groupby('Class').mean()

       Marks
Class
A      64.90
B      56.67

In [71]:
check = {"name":["Rahul","Ramesh"],"age":[23,66],"hobby":["Playing","Dancing"]}

check_s = pd.Series(check)

check_s

name        [Rahul, Ramesh]
age                [23, 66]
hobby    [Playing, Dancing]
dtype: object

In [72]:
check_d = pd.DataFrame(check)

check_d

     name  age    hobby
0   Rahul   23  Playing
1  Ramesh   66  Dancing

In [73]:
stud_dict = {"name":["Rahul","Ramesh"],"age":[23,66],"hobby":["Playing","Dancing"]}

stud_df = pd.DataFrame(stud_dict)

for index,row in stud_df.iterrows():
    print(index,row)

0 name       Rahul
age           23
hobby    Playing
Name: 0, dtype: object
1 name      Ramesh
age           66
hobby    Dancing
Name: 1, dtype: object

In [74]:
sort_df =stud_df.sort_values(by=['hobby'])

sort_df

     name  age    hobby
1  Ramesh   66  Dancing
0   Rahul   23  Playing

In [75]:
sort_df = stud_df.sort_values(by=['age'])

sort_df

     name  age    hobby
0   Rahul   23  Playing
1  Ramesh   66  Dancing

In [76]:
# formatting the dataframe into dictionary 

dict = sort_df.to_dict()

dict

{'name': {0: 'Rahul', 1: 'Ramesh'},
 'age': {0: 23, 1: 66},
 'hobby': {0: 'Playing', 1: 'Dancing'}}

In [77]:
csv_file = sort_df.to_csv()

csv_file

',name,age,hobby\n0,Rahul,23,Playing\n1,Ramesh,66,Dancing\n'

In [80]:
from pprint import pprint
json_file = sort_df.to_json()

pprint(json_file)

'{"name":{"0":"Rahul","1":"Ramesh"},"age":{"0":23,"1":66},"hobby":{"0":"Playing","1":"Dancing"}}'